01  WS-AREA. 
05  WS-NUMBER PIC 9(5) VALUE 99999. 
05  WS-NUMBER2 PIC 9(5). 

PROCEDURE DIVISION. 
    ADD 1 TO WS-NUMBER. 
    MOVE WS-NUMBER TO WS-NUMBER2. 
    DISPLAY "WS-NUMBER: " WS-NUMBER 
             "WS-NUMBER2: " WS-NUMBER2. 
    STOP RUN.